{
    "intents": [
      {"tag": "greeting",
       "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day", "Hey", "Hi"],
       "responses": ["Hi, My name is Bot. Can I help you with any cancer related medical question today?"]
      },
      {"tag": "goodbye",
       "patterns": ["Bye", "See you later", "Goodbye", "Ok bye", "Bye Bye"],
       "responses": ["See you!", "Have a nice day", "Bye", "Bye! Take Care"]
      },
      {"tag": "thanks",
       "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
       "responses": ["Happy to help!", "Any time!", "My pleasure", "You are welcome"]
      },
      {"tag": "noanswer",
       "patterns": [" "],
       "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "Please ask a different question"]
       },
       {"tag": "name",
        "patterns": ["What is your name", "Whats your name", "Tell me your name", "Who are you", "Tell me about yourself", "You are"],
        "responses": ["Hi, My name is Bot. I am here to help you with any cancer related medical question"]
        },
        {"tag": "options",
         "patterns": ["What do you do", "How can you help", "What do you know", "What is your purpose", "How can you help"],
         "responses": ["I am here to help you with any cancer related medical question"]
        },
        {
          "tag":"sympathy",
          "patterns":["I have cancer","I have been diagnosed with cancer"],
          "responses":["Oh! I am so sorry to hear that. What kind of cancer you are diagnosed with? I can help answer some questions that you may have"]
        },
        {
          "tag":"death",
          "patterns":["Will I die soon","I am nervous","What if i die","I am scared for my life"],
          "responses":["I am just a chatbot. I cannot answer this for you. But whatever the situation is, you have to <b>STAY STRONG!</b> You should go visit a doctor. We are in this fight together!"]
        },
        {"tag": "clinical_trials",
         "patterns": ["clinical trials", "what are clinical trials", "interventional studies", "Tell me about clinical trials", "How to find clinical trials"],
         "responses": [ "If you have cancer, you may choose to join a clinical trial. A clinical trial is a scientific study to find out which treatments or devices are safe and if they work well. <br> Clinical trials are very important. They help doctors learn about cancer and develop better treatments that can help you and other people in the future. If you are thinking about joining a clinical trial as a treatment option, the best place to start is to talk with your doctor or another member of your health care team. Often, your doctor may know about a clinical trial that could be a good option for you. He or she may also be able to search for a trial for you, provide information, and answer questions to help you decide about joining a clinical trial. If you decide to look for trials on your own, you can follow these steps to get a clinical trial - <ol><li>Gather details about your cancer</li><li>Find clinical trials</li><li>Take a closer look at the trials that interest you</li><li>Contact the team running the trial</li><li>Ask questions</li><li>Make an appointment</li></ol> For further details about these steps <a href = 'https://www.cancer.gov/about-cancer/treatment/clinical-trials/search/trial-guide' target='_blank'>Click here</a>" ] 
        },
        {"tag": "cancer",
         "patterns": ["cancer ", "what is cancer", "how is cancer caused", "what leads to cancer"],
         "responses": [ "Cancer is caused by certain changes to genes, the basic physical units of inheritance. Genes are arranged in long strands of tightly packed DNA called chromosomes. Cancer is a genetic disease—that is, it is caused by changes to genes that control the way our cells function, especially how they grow and divide." ]
        },
        {"tag": "cancer_survivors",
         "patterns": ["cancer survivors", "health care providers", "survivor stories", "life after cancer"],
         "responses": [ "When your treatment is finished, your doctor may tell you that you should get checkups or tests in the future. This is called follow-up care. Be sure to follow your doctor’s instructions. These tests can help find early signs of a new or the same cancer. You can lower your risk of getting cancer again or having the cancer come back by making healthy choices <a href = 'https://www.cdc.gov/cancer/survivors/life-after-cancer/staying-healthy-after-cancer-treatment.htm' target='_blank'>like</a> <br> Cancer is just a chapter in our lives and not the whole story. To read inspiring stories of people who won the battle against cancer <a href = 'https://www.cdc.gov/cancer/survivors/stories/index.htm' target='_blank'>Click here</a> <br> For information about how to stay physically healthy <a href = 'https://www.cdc.gov/cancer/survivors/caregivers/helping-cancer-survivors-stay-healthy.htm' target='_blank'>Click here</a>" ]
        },
        {"tag": "cancer_treatment",
         "patterns": ["cancer treatment", "how to treat cancer", "who treats cancer", "where to go if i have been treated with cancer"],
         "responses": [ "Start by making an appointment with your doctor if you have any signs or symptoms that worry you. If your doctor determines that you have cancer, you'll likely be referred to one or more specialists, such as: Doctors who treat cancer (oncologists) or Doctors who treat cancer with radiation (radiation oncologists). The most common treatments of cancer are surgery, chemotherapy, and radiation." ]
        },

        {"tag": "cancer_stages",
         "patterns": ["cancer stages", "what are the differnet stages of cancer", "tell me stages of cancer", "four stages"],
         "responses": [ " Most cancers are grouped by stage, a description of cancer that aids in planning treatment. The stage of a cancer is based on:<ul><li>The location and size of the tumor</li><li>The extent to which your lymph nodes are affected</li><li>The degree to which the cancer spread, if at all, to other tissue and organs</li></ul><br>Your healthcare provider uses information from various tests, including CT, MRI and biopsy, to determine the stage of cancer.<br><ul><li><b>Stage I:</b>The tumor is 7 centimeters (cm) across or smaller and is only in your kidney. It hasn’t spread to lymph nodes or other tissue. (Lymph nodes are small “filters” that trap germs and cancer cells and store infection-fighting cells.)</li><li><b>Stage II:</b>The tumor is larger than 7 cm across but is still only in your kidney. It hasn’t spread to lymph nodes or other tissue</li><li><b>Stage III:</b>The tumor has spread to your major blood vessels — your renal vein and inferior vena cava — or into the tissue surrounding your kidney or to nearby lymph nodes</li><li><b>Stage IV:</b>The tumor has spread outside of your kidney to your adrenal gland (the small gland that sits on top of your kidney), or to distant lymph nodes or other organs</li></ul><br>Tumors are also graded, which is a way of rating a tumor based on how abnormal its cells look. Tumor grading can also tell your healthcare provider how fast the tumor is likely to grow. Tumors whose cells don’t look like normal cells and divide rapidly are called high-grade tumors. High-grade tumors tend to grow and spread more quickly than low-grade tumors<br><a href = 'https://www.youtube.com/watch?v=UCNx78zIrwU' target='_blank'>Click Here</a> " ]
        },
        
       {"tag": "cancer_contagious",
        "patterns": ["cancer contagious", "is cancer contagious", "can i get cancer from other people", "can my parents give me cancer", "is cancer herditary"],
        "responses": [ "Cancer is not contagious. There is nothing that will cause a cancer to be passed from one person to another, except for extremely rare circumstances. Some genes can lead certain families to develop certain kinds of cancers, but one does not inherit cancer; one inherits genes" ]
       },
       {"tag": "radiation_therapy",
	      "patterns": ["fatigue from radiation therapy", "what can i expect from radiation", "what can be done to reduce fatigue after radiation therapy"],
        "responses": ["Fatigue related to radiation treatments usually starts about the second or third week of treatment, and may continue for up to 3 months or longer afterward. It is important to take good care of yourself. This means eating a well-balanced diet, drinking lots of fluid, sleeping well at night, and doing exercise as tolerated, such as walking regularly. Once you start feeling fatigued, match your activity to how you feel. You should identify the activities or tasks that you have to do, and ask someone else to do the other tasks. <ol><li>if you are driving yourself to your radiation treatments, see if someone else can drive you to your radiation treatments when you start feeling tired.</li><li>try keeping a diary of how you feel, what makes you feel more energetic, what makes you feel more tired. Don't do the more tiring activities. Rate the activities using a simple scale, such as on a scale of 0 (full of energy) to 10 (absolutely exhausted, no energy). This will help you in identifying severity of the fatigue.</li><li>talk with your doctor or nurse about problems that arise, or if your fatigue is severe.</li></ol>"]
       },
       {"tag": "cancer_vaccine",
        "patterns": ["cancer vaccine", "is there a vaccine for cancer", "can i get cancer vaccine"],
        "responses": [ "There is no vaccine for cancer. But there are vaccines for some viruses that are known to cause cancer, such as the human papillomavirus (HPV) and hepatitis B.<br>HPV can cause cancer and getting vaccinated against it can help protect against the types of HPV that can lead to cervical, anal, throat, and penile cancers, along with some other forms of cancer. The HPV vaccine protects against many strains of the virus that can cause these cancers. <br> The same is true for infection with the hepatitis B virus, which has been linked to liver cancer. Getting vaccinated against hepatitis B can reduce your risk for getting liver cancer. But just like the HPV vaccine, the hepatitis B vaccine doesn’t protect against liver cancer itself. It only protects against the virus that might lead to liver cancer." ]
       },
       {"tag": "family",
        "patterns": ["How can I ask my family to help me", "how should my family and friends help me", "how can people help me", "friends and family support"],
        "responses": ["This may be one of the hardest things to do. Most family members and friends want to help and are just waiting to do something. Often they feel helpless, and afraid to ask if they can help. Take the lead in talking. Some family members and friends may avoid talking with you because they do not know what to say. By being very specific about what you would like them to do, it will make it much easier for them to help. Others may avoid talking about cancer, fearing that they will upset you. If you feel like talking about your cancer, bring up the subject with your friends and family members. Let them know that it is okay to talk about it. Reassure them that you do not expect answers and that you only want them to listen and to try to understand your feelings. It is also okay to tell people when you do not want to talk about cancer. At times, you might prefer to talk about other things or just laugh with your friends. Focusing on things you enjoy or provide a sense of calm can be important to your well being. Let people help you."]
      },
       {"tag": "cancer_tests",
        "patterns": ["cancer screening", "should i get tested for cancer", "Cancer tests","should i get screening done"],
        "responses":["Cancer can affect various tissues in the body, causing a range of signs and symptoms, such as weight loss, fatigue, skin changes, and a persistent cough. Screening means checking your body for cancer before you have symptoms. Recommendations for the types of screening tests and the ages you should get them vary according to cancer type. So, it’s a good idea to have a conversation with your doctor about what type of test you might need and when. Getting screening tests regularly may find breast, cervical, and colorectal (colon) cancers early, when treatment is likely to work best. "]
       },   
       {"tag": "breast_cancer",
        "patterns": ["What is breast cancer", "Tell me about breast cancer", "breast cancer", "What about breast cancer", "What do you know about breast cancer", "Tell me more about breast cancer", "What can you tell me about breast cancer", "What about breast cancer"],
        "responses": ["Breast cancer is cancer that forms in the cells of the breasts. It can occur in both men and women, but it's far more common in women. The kind of breast cancer depends on which cells in the breast turn into cancer. Breast cancer can spread outside the breast through blood vessels and lymph vessels. When breast cancer spreads to other parts of the body, it is said to have metastasized. To know more, check this out - <a href= 'https://www.cdc.gov/cancer/breast/basic_info/what-is-breast-cancer.htm' target='_blank'> Click Here </a>"]
        },
        {"tag": "symptoms_breast_cancer",
         "patterns": ["Symptoms of breast cancer", "Tell me some symptoms of breast cancer", "what are some of the symptoms of breast cancer", "How do i know if i have breast cancer", "Warning signs of breast cancer"],
         "responses": [ "Some warning signs of breast cancer are—<ul><li>New lump in the breast or underarm (armpit)</li><li>Thickening or swelling of part of the breast</li><li>Irritation or dimpling of breast skin</li><li>Redness or flaky skin in the nipple area or the breast</li><li>Pulling in of the nipple or pain in the nipple area</li><li>Nipple discharge other than breast milk, including blood</li><li>Any change in the size or the shape of the breast</li><li>Pain in any area of the breast</li></ul> To know more, check this out - <a href= 'https://www.youtube.com/watch?v=LrfE6JUwIms' target='_blank'> Click Here </a>"    ]
        },
        {"tag": "treatment_breast_cancer",
         "patterns": ["cure of breast cancer", "Tell me some treatments of breast cancer", "how can breast cancer be treated"],
         "responses": [ "Breast cancer is treated in several ways. It depends on the kind of breast cancer and how far it has spread. People with breast cancer often get more than one kind of treatment.<ol><li><b>Surgery</b>- An operation where doctors cut out cancer tissue</li><li><b>Chemotherapy</b>- Using special medicines to shrink or kill the cancer cells. The drugs can be pills you take or medicines given in your veins, or sometimes both.</li><li><b>Hormonal therapy</b>- Blocks cancer cells from getting the hormones they need to grow</li><li><b>Biological therapy</b>- Works with your body’s immune system to help it fight cancer cells or to control side effects from other cancer treatments.</li><li><b>Radiation therapy</b>- Using high-energy rays (similar to X-rays) to kill the cancer cells.</li></ul> "    ]
        },
        {"tag": "prevention_of_breast_cancer",
         "patterns": ["how can the risk of breast cancer be reduced", "Prevention of breast cancer", "how can breast cancer be prevented","reduce the risk of breast cancer"],
         "responses": [ "Many factors over the course of a lifetime can influence your breast cancer risk. You can’t change some factors, such as getting older or your family history, but you can help lower your risk of breast cancer by taking care of your health in the following ways-<br><ul><li>Keep a healthy weight</li><li>Exercise regularly</li><li>Don’t drink alcohol, or limit alcoholic drinks</li><li>If you are taking, or have been told to take, hormone replacement therapyexternal icon or oral contraceptivesexternal icon (birth control pills), ask your doctor about the risks and find out if it is right for you</li><li>Breastfeed your children, if possible</li><li>If you have a family history of breast cancer or inherited changes in your BRCA1 and BRCA2 genes, talk to your doctor about other ways to lower your risk</li></ul>Staying healthy throughout your life will lower your risk of developing cancer, and improve your chances of surviving cancer if it occurs."    ]
        },
        {"tag": "lung_cancer",
        "patterns": ["What is lung cancer", "Tell me about lung cancer", "lung cancer", "What about lung cancer", "What do you know about lung cancer", "Tell me more about lung cancer", "What can you tell me about lung cancer", "What about lung cancer"],
        "responses": ["Lung cancer is a type of cancer that begins in the lungs. People who smoke have the greatest risk of lung cancer, though lung cancer can also occur in people who have never smoked. Lung cancers usually are grouped into two main types called small cell and non-small cell (including adenocarcinoma and squamous cell carcinoma). These types of lung cancer grow differently and are treated differently. Non-small cell lung cancer is more common than small cell lung cancer. To know more, check this out - <a href= 'https://www.cdc.gov/cancer/lung/basic_info/what-is-lung-cancer.htm' target='_blank'> Click Here </a>"]
        },
        {"tag": "symptoms_lung_cancer",
         "patterns": ["Symptoms of lung cancer", "Tell me some symptoms of lung cancer", "what are some of the symptoms of lung cancer", "How do i know if i have lung cancer", "Warning signs of lung cancer"],
         "responses": [ "Different people have different symptoms for lung cancer. Some people have symptoms related to the lungs. Some people whose lung cancer has spread to other parts of the body (metastasized) have symptoms specific to that part of the body. Some people just have general symptoms of not feeling well. Most people with lung cancer don’t have symptoms until the cancer is advanced. Lung cancer symptoms may include—<ul><li>Coughing that gets worse or doesn’t go away</li><li>Chest pain</li><li>Shortness of breath</li><li>Wheezing</li><li>Coughing up blood</li><li>Feeling very tired all the time</li><li>Weight loss with no known cause</li></ul> To know more, check this out <a href= 'https://www.youtube.com/watch?v=CutRFPEeftk' target='_blank'>Click Here </a>"    ]
        },
        {"tag": "treatment_lung_cancer",
         "patterns": ["cure of lung cancer", "Tell me some treatments of lung cancer", "how can lung cancer be treated"],
         "responses": [ "Lung cancer is treated in several ways, depending on the type of lung cancer and how far it has spread. People with non-small cell lung cancer can be treated with surgery, chemotherapy, radiation therapy, targeted therapy, or a combination of these treatments. People with small cell lung cancer are usually treated with radiation therapy and chemotherapy.<ul><li><b>Surgery</b>- An operation where doctors cut out cancer tissue.</li><li><b>Chemotherapy</b> Using special medicines to shrink or kill the cancer cells. The drugs can be pills you take or medicines given in your veins, or sometimes both.</li><li><b>Radiation therapy</b>- Using high-energy rays (similar to X-rays) to kill the cancer cells.</li><li><b>Targeted therapy</b>- Using drugs to block the growth and spread of cancer cells. The drugs can be pills you take or medicines given in your veins. You will get tests to see if targeted therapy is right for your cancer type before this treatment is used.</li></ul> "    ]
        },
        {"tag": "prevention_of_lung_cancer",
         "patterns": ["how can the risk of lung cancer be reduced", "Prevention of lung cancer", "how can lung cancer be prevented","reduce the risk of lung cancer"],
         "responses": [ "You can help lower your risk of lung cancer in the following ways—<ul><li><b>Don’t smoke</b>- Cigarette smoking causes about 80% to 90% of lung cancer deaths. The most important thing you can do to prevent lung cancer is to not start smoking, or to quit if you smoke</li><li><b>Avoid secondhand smoke</b>- Smoke from other people’s cigarettes, cigars, or pipes is called secondhand smoke. Make your home and car smoke-free.</li><li><b>- Be careful at work</b> Health and safety guidelines in the workplace can help workers avoid carcinogens—things that can cause cancer.</li></ul>"    ]
        },
        {"tag": "skin_cancer",
         "patterns": ["What is skin cancer", "Tell me about skin cancer", "skin cancer", "What do you know about skin cancer", "Tell me more about skin cancer", "What can you tell me about skin cancer", "What about skin cancer"],
         "responses": ["Skin cancer — the abnormal growth of skin cells — most often develops on skin exposed to the sun. But this common form of cancer can also occur on areas of your skin not ordinarily exposed to sunlight. There are three major types of skin cancer — basal cell carcinoma, squamous cell carcinoma and melanoma. To know more, check this out <a href = 'https://www.cdc.gov/cancer/skin/basic_info/what-is-skin-cancer.htm' target='_blank'>Click here</a>"]
        },
        {"tag": "symptoms_skin_cancer",
         "patterns": ["Symptoms of skin cancer", "Tell me some symptoms of skin cancer", "what are some of the symptoms of skin cancer", "How do i know if i have skin cancer", "Warning signs of skin cancer"],
         "responses": [ "A change in your skin is the most common sign of skin cancer. This could be a new growth, a sore that doesn’t heal, or a change in a mole.external icon Not all skin cancers look the same. For melanoma specifically, a simple way to remember the warning signs is to remember the A-B-C-D-Es of melanoma—<ul><li>Asymmetrical: Does the mole or spot have an irregular shape with two parts that look very different?</li><li>Border: Is the border irregular or jagged?</li><li>Color: Is the color uneven?</li><li>Diameter: Is the mole or spot larger than the size of a pea?</li><li>Evolving: Has the mole or spot changed during the past few weeks or months?</li></ul> To know more, check this out - <a href= 'https://www.youtube.com/watch?v=7wrQNUUAb8M' target='_blank'> Click Here </a>"    ]
        },
        {"tag": "treatment_skin_cancer",
        "patterns": ["cure of skin cancer", "Tell me some treatments of skin cancer", "how can skin cancer be treated"],
        "responses": [ "Your treatment options for skin cancer and the precancerous skin lesions known as actinic keratoses will vary, depending on the size, type, depth and location of the lesions. Small skin cancers limited to the surface of the skin may not require treatment beyond an initial skin biopsy that removes the entire growth. If additional treatment is needed, options may include -<ul><li>ExcisionalSurgery</li><li>Freezing</li><li>Mohs surgery</li><li>Curettage and electrodesiccation or cryotherapy</li><li>Radiation therapy</li><li>Chemotherapy</li><li>Photodyanamic therapy</li><li>Biological therapy</li></ul>To know more, check this out <a href = 'https://www.mayoclinic.org/diseases-conditions/skin-cancer/diagnosis-treatment/drc-20377608' target='_blank'>Click here</a> "    ]
       },
       {"tag": "prevention_of_skin_cancer",
       "patterns": ["how can the risk of skin cancer be reduced", "Prevention of skin cancer", "how can skin cancer be prevented","reduce the risk of skin cancer"],
       "responses": [ "Most skin cancers are caused by too much exposure to ultraviolet (UV) rays. UV rays come from the sun, tanning beds, and sunlamps. UV rays can damage skin cells. To lower your risk of getting skin cancer, you can protect your skin from UV rays from the sun, and avoid artificial sources of UV exposure by -<ul><li>Practicing sun safety</li><li>Avoiding indoor tanning</li></ul> For more information regarding sun safety <a href = 'https://www.cdc.gov/cancer/skin/basic_info/sun-safety.htm' target='_blank'>Click here</a>"    ]
       },
        {"tag": "prostate_cancer",
         "patterns": ["What is prostate cancer", "Tell me about prostate cancer", "prostate cancer", "What do you know about prostate cancer", "Tell me more about prostate cancer", "What can you tell me about prostate cancer", "What about prostate cancer"],
         "responses": ["Prostate cancer begins when cells in the prostate gland start to grow out of control. The prostate is a gland found only in males. It makes some of the fluid that is part of semen. Almost all prostate cancers are adenocarcinomas. These cancers develop from the gland cells (the cells that make the prostate fluid that is added to the semen). Other types of cancer that can start in the prostate include: Small cell carcinomas, Neuroendocrine tumors (other than small cell carcinomas), Transitional cell carcinomas and Sarcomas. These other types of prostate cancer are rare. If you are told you have prostate cancer, it is almost certain to be an adenocarcinoma. To know more, check this out <a href = 'https://www.cdc.gov/cancer/prostate/basic_info/what-is-prostate-cancer.htm' target='_blank'>Click here</a>"]
        },
        {"tag": "symptoms_prostate_cancer",
         "patterns": ["Symptoms of prostate cancer", "Tell me some symptoms of prostate cancer", "what are some of the symptoms of prostate cancer", "How do i know if i have prostate cancer", "Warning signs of prostate cancer"],
         "responses": [ "If you have any of the following symptoms, be sure to see your doctor right away—<ul><li>Difficulty starting urination</li><li>Chest pain</li><li>Weak or interrupted flow of urine</li><li>Urinating often, especially at night</li><li>Trouble emptying the bladder completely</li><li>Pain or burning during urination</li><li>Blood in the urine or semen</li><li>Pain in the back, hips, or pelvis that doesn’t go away</li><li>Painful ejaculation</li></ul>Keep in mind that these symptoms may be caused by conditions other than prostate cancer.<br> To know more, check this out <a href= 'https://www.youtube.com/watch?v=WnF3ozjMM7I' target='_blank' >Click Here </a>"    ]
        },
        {"tag": "treatment_prostate_cancer",
         "patterns": ["cure of prostate cancer", "Tell me some treatments of prostate cancer", "how can prostate cancer be treated"],
         "responses": [ "Different types of treatment are available for prostate cancer. You and your doctor will decide which treatment is right for you. Some common treatments are—<ul><li><b>Expectant management</b>- If your doctor thinks your prostate cancer is unlikely to grow quickly, he or she may recommend that you don’t treat the cancer right away. Instead, you can choose to wait and see if you get symptoms in one of two ways:<li><b>Active surveillance</b>-Closely monitoring the prostate cancer by performing prostate specific antigen (PSA) tests and prostate biopsies regularly, and treating the cancer only if it grows or causes symptoms</li><li><b>Watchful waiting</b>-No tests are done. Your doctor treats any symptoms when they develop. This is usually recommended for men who are expected to live for 10 more years or less</li></li><li><b>Surgery</b> A prostatectomy is an operation where doctors remove the prostate. Radical prostatectomy removes the prostate as well as the surrounding tissue</li><li><b>Radiation therapy</b>- Using high-energy rays (similar to X-rays) to kill the cancer cells. There are two types of radiation therapy— <li><b>External radiation therapy</b>-A machine outside the body directs radiation at the cancer cells</li><li><b>Internal radiation therapy (brachytherapy)</b></li></li></ul><br> Other therapies used in the treatment of prostate cancer that are still under investigation include—<ul><li><b>Cryotherapy</b>-Placing a special probe inside or near the prostate cancer to freeze and kill the cancer cells</li><li><b>Chemotherapy</b>- Using special drugs to shrink or kill the cancer. The drugs can be pills you take or medicines given through your veins, or, sometimes, both</li><li><b>Biological therapy</b>-Works with your body’s immune system to help it fight cancer or to control side effects from other cancer treatments. Side effects are how your body reacts to drugs or other treatments</li><li><b>High-intensity focused ultrasound</b>-This therapy directs high-energy sound waves (ultrasound) at the cancer to kill cancer cells</li><li><b>Hormone therapy</b>-Blocks cancer cells from getting the hormones they need to grow</li></ul> "    ]
        },
        {"tag": "prevention_of_prostate_cancer",
         "patterns": ["how can the risk of prostate cancer be reduced", "Prevention of prostate cancer", "how can prostate cancer be prevented","reduce the risk of prostate cancer"],
         "responses": [ "There's no proven prostate cancer prevention strategy. But you may reduce your risk of prostate cancer by making healthy choices, such as exercising and eating a healthy diet.<ul><li><b>Choose a healthy diet</b><li>Choose a low-fat diet</li><li>Increase the amount of fruits and vegetables you eat each day</li><li>Reduce the amount of dairy products you eat each day</li></li><li><b>Maintain a healthy weight</b></li><li><b>Exercise most days of the week</b></li><li><b>Talk to your doctor about your risk</b></li></ul>"    ]
        },
        {"tag": "kidney_cancer",
         "patterns": ["what is kidney cancer", "tell me about kidney cancer", "kidney cancer"],
         "responses": ["When cancer starts in the kidney, it is called kidney and renal pelvis cancer. It can also be called renal cell cancer as that is the most common type of kidney and renal pelvis cancer."]
        },
        {"tag": "symptoms_kidney_cancer",
         "patterns": ["Symptoms of kidney cancer", "Tell me some symptoms of kidney cancer", "what are some of the symptoms of kidney cancer", "How do i know if i have kidney cancer", "Warning signs of kidney cancer"],
         "responses": [ "The symptoms listed below can also come from other causes. If you have any of these symptoms, talk to your doctor.<ul><li>Blood in the urine</li><li>A lump or swelling in the kidney area or abdomen</li><li>Lower back pain or pain in the side that doesn’t go away</li><li>Feeling tired often</li><li>Fever that keeps coming back</li><li>Not feeling like eating</li><li>Losing weight for no reason that you know of</li><li>Something blocking your bowels</li><li>A general feeling of poor health</li></ul> To know more, check this out - 'https://www.youtube.com/watch?v=14x88S--uw0' target='_blank'> Click Here </a>"    ]
        },
        {"tag": "treatment_kidney_cancer",
         "patterns": ["cure of kidney cancer", "Tell me some treatments of kidney cancer", "how can kidney cancer be treated"],
         "responses": [ "Kidney cancer treatment depends on the stage and grade of the tumor, as well as your age and overall health. Options include surgery, ablation, radiation therapy, targeted drug therapy, immunotherapy and sometimes chemotherapy.<ul><li><b>Surgery</b>- Surgery is the treatment of choice for most stages of kidney cancer. Several surgical options may be considered, including:<li><b>Partial nephrectomy:</b>Your surgeon removes the part of your kidney that contains the tumor</li><li><b>Radical nephrectomy:</b>Your surgeon removes your entire kidney and some of the tissue around it. They may also remove some lymph nodes in the area</li>When one kidney is removed, the remaining kidney is usually able to perform the work of both kidneys.</li><li><b>Ablation</b>- Sometimes, heat and cold can destroy cancer cells. People who aren’t candidates for surgery may benefit from cryoablation or radiofrequency ablation.<li><b>Cryoablation:</b>During this procedure, your healthcare provider inserts a needle through your skin and into the kidney tumor. The cancer cells are then frozen with cold gas.</li><li><b>Radiofrequency ablation:</b>Your healthcare provider inserts a needle through your skin and into the kidney tumor. Next, an electrical current is passed through the cancer cells to destroy them</li></li><li><b>Radiation therapy</b>- Using high-energy rays (similar to X-rays) to kill the cancer cells. Your healthcare provider may recommend radiation therapy if you only have one kidney or if you’re not eligible for surgery. Radiation therapy is most often used for easing kidney cancer symptoms, such as pain</li><li><b>Targeted drug therapy</b>-Targeted drug therapy blocks certain characteristics that help cancer cells thrive. For example, these drugs can stop the growth of new blood vessels or proteins that feed cancer. Targeted drug therapy is often used when surgery isn’t an option. In some cases, these medications may be given after surgery to reduce the risk of cancer coming back.</li><li><b>Immunotherapy</b>-Immunotherapy uses certain medications to boost your own immune system. In turn, this helps your body recognize and destroy cancer cells more effectively. Immunotherapy may be given as a standalone treatment or along with surgery.</li><li><b>Chemotherapy</b>-Chemotherapy isn’t a standard treatment for kidney cancer. But it can be helpful in some cases — usually only after trying immunotherapy and targeted drug therapy. Chemotherapy medications are taken by mouth or given through a vein (intravenously) and are generally well tolerated.</li></ul> "    ]
        },
        {"tag": "prevention_of_kidney_cancer",
         "patterns": ["how can the risk of skin cancer be reduced", "Prevention of skin cancer", "how can skin cancer be prevented","reduce the risk of skin cancer"],
         "responses": [ "To lower your risk of kidney and renal pelvis cancers— <ul><li>Don’t smoke, or quit if you do.</li><li>Keep a healthy weight.</li><li>Eat a healthy diet.</li><li>Exercise.</li><li>Be very careful if you use certain kinds of chemicals, especially trichloroethylene. This chemical is used by workers in some jobs, like those that work with metals.</li></ul>"    ]
        },
        {
          "tag":"specialists",
          "patterns":["can you suggest me some specialists?","specialists","recommend specialists","doctor","search doctor"],
          "responses":["You can check them out here: <a href= '/templates/indexes.html#specialists' target='_blank'> Click Here </a>"]
        }
    ]
  }